<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a53d0ca7912a0903c86fe2f29f8e3da814842c70c3d9f93dca079ce694072107","plan_job_ref":"Job OpenTofu AWS RDS Deployment #22 at https://github.com/cheetah1989/opentofu-rds/actions/runs/21119400318","plan_out_hash":"596c3fd0c4b2810b0a30fcdff123931126276b4caf84e8bd84def80eb61d0446","plan_hash":"f3bdea69de79ac5cce3aae6479fc891bff06b136922a87289961e5b1fa2ab775","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan in __opentofu_rds_iac__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # aws_instance.opentofu_bastion will be created
+   resource "aws_instance" "opentofu_bastion" {
+       ami                                  = "ami-0ced6a024bb18ff2e"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       force_destroy                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "opentofu_keypair"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_group_id                   = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       region                               = "ap-south-1"
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "************************"
+       tags                                 = {
+           "Name"    = "opentofu_bastion"
+           "Purpose" = "Bastion Host for RDS Access"
        }
+       tags_all                             = {
+           "Environment" = "Practice-Sandbox"
+           "Name"        = "opentofu_bastion"
+           "Owner"       = "Chetan Pardeshi"
+           "Purpose"     = "Bastion Host for RDS Access"
        }
+       tenancy                              = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = [
+           "sg-0da0ac8702928ab0d",
        ]

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       primary_network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   ec2_bastion_public_ip = (known after apply)
```
</details>

:memo: Plan generated in [OpenTofu AWS RDS Deployment #22](https://github.com/cheetah1989/opentofu-rds/actions/runs/21119400318)